{"config": {"name": "sequential_6", "layers": [{"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "name": "dense_46", "kernel_regularizer": null, "batch_input_shape": [null, 784]}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "name": "dense_47", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "name": "dropout_2", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "name": "dense_48", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "name": "dropout_3", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "name": "dense_49", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "name": "dropout_4", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "distribution": "normal", "scale": 2.0}, "class_name": "VarianceScaling"}, "name": "dense_50", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "momentum": 0.99, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "axis": -1, "name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_51", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.3"}